

const Step = () => {
	return (
		<section className='py-14' id="step">
			<div className='container mx-auto'>
				<div className='text-center'>
					<h4 className='text-2xl sm:text-4xl font-bold text-primary uppercase'>
						Этапы установки дверей
					</h4>
				</div>

				<div className='mt-10'>
					<ul className="timeline timeline-snap-icon max-md:timeline-compact timeline-vertical">
						<li>
							<div className="timeline-middle text-primary">
								<svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 20 20" fill="currentColor" className="h-5 w-5"><path fillRule="evenodd" d="M10 18a8 8 0 100-16 8 8 0 000 16zm3.857-9.809a.75.75 0 00-1.214-.882l-3.483 4.79-1.88-1.88a.75.75 0 10-1.06 1.061l2.5 2.5a.75.75 0 001.137-.089l4-5.5z" clipRule="evenodd" /></svg>
							</div>
							<div className="timeline-start md:text-end mb-10">
								<div className="text-lg font-black text-primary">
									Консультация по выбору дверей
								</div>
								Наши специалисты готовы предоставить вам исчерпывающую консультацию по выбору подходящих дверей. Мы учтем ваши предпочтения, стиль интерьера и бюджетные ограничения, чтобы помочь вам сделать информированный выбор. В процессе консультации мы также расскажем о наших услугах, возможных вариантах установки и ответим на все ваши вопросы.
							</div>
							<hr />
						</li>
						<li>
							<hr />
							<div className="timeline-middle text-primary">
								<svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 20 20" fill="currentColor" className="h-5 w-5"><path fillRule="evenodd" d="M10 18a8 8 0 100-16 8 8 0 000 16zm3.857-9.809a.75.75 0 00-1.214-.882l-3.483 4.79-1.88-1.88a.75.75 0 10-1.06 1.061l2.5 2.5a.75.75 0 001.137-.089l4-5.5z" clipRule="evenodd" /></svg>
							</div>
							<div className="timeline-end mb-10">
								<div className="text-lg font-black text-primary">
									Доставка дверей
								</div>
								Мы организуем быструю и надежную доставку выбранных вами дверей прямо на ваш объект. Наша служба доставки работает оперативно, обеспечивая безопасность и сохранность товара в процессе транспортировки. Мы учитываем удобные для вас сроки и местоположение, чтобы сделать процесс получения дверей максимально удобным для вас.
							</div>
							<hr />
						</li>
						<li>
							<hr />
							<div className="timeline-middle text-primary">
								<svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 20 20" fill="currentColor" className="h-5 w-5"><path fillRule="evenodd" d="M10 18a8 8 0 100-16 8 8 0 000 16zm3.857-9.809a.75.75 0 00-1.214-.882l-3.483 4.79-1.88-1.88a.75.75 0 10-1.06 1.061l2.5 2.5a.75.75 0 001.137-.089l4-5.5z" clipRule="evenodd" /></svg>
							</div>
							<div className="timeline-start md:text-end mb-10">
								<div className="text-lg font-black text-primary">
									Демонтаж старых дверей
								</div>
								При заказе установки новых дверей у нас, мы предоставляем услугу по бесплатному демонтажу старых дверей. Наши опытные специалисты произведут демонтаж без повреждения окружающих элементов интерьера. Это удобное решение, которое сэкономит ваше время и усилит процесс обновления дверного проема. Мы обеспечиваем профессиональный и аккуратный демонтаж, предоставляя вам дополнительное удобство в реализации вашего проекта.
							</div>
							<hr />
						</li>
						<li>
							<hr />
							<div className="timeline-middle text-primary">
								<svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 20 20" fill="currentColor" className="h-5 w-5"><path fillRule="evenodd" d="M10 18a8 8 0 100-16 8 8 0 000 16zm3.857-9.809a.75.75 0 00-1.214-.882l-3.483 4.79-1.88-1.88a.75.75 0 10-1.06 1.061l2.5 2.5a.75.75 0 001.137-.089l4-5.5z" clipRule="evenodd" /></svg>
							</div>
							<div className="timeline-end mb-10">
								<div className="text-lg font-black text-primary">
									Сборка блока
								</div>
								На этом этапе наши мастера производят сборку дверного блока с учетом всех технических особенностей и ваших индивидуальных предпочтений. Мы гарантируем, что каждая деталь будет установлена с высокой точностью, обеспечивая идеальную подгонку и функциональность дверного механизма. Каждый этап сборки контролируется опытными специалистами для обеспечения высокого стандарта качества и долговечности вашей новой двери.
							</div>
							<hr />
						</li>
						<li>
							<hr />
							<div className="timeline-middle text-primary">
								<svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 20 20" fill="currentColor" className="h-5 w-5"><path fillRule="evenodd" d="M10 18a8 8 0 100-16 8 8 0 000 16zm3.857-9.809a.75.75 0 00-1.214-.882l-3.483 4.79-1.88-1.88a.75.75 0 10-1.06 1.061l2.5 2.5a.75.75 0 001.137-.089l4-5.5z" clipRule="evenodd" /></svg>
							</div>
							<div className="timeline-start md:text-end mb-10">
								<div className="text-lg font-black text-primary">
									Врезка фурнитуры
								</div>
								На этом этапе наши мастера производят врезку фурнитуры с максимальной точностью и аккуратностью. Мы уделяем внимание каждой детали, чтобы обеспечить правильное функционирование замков, петель и других элементов дверного механизма. Врезка фурнитуры проводится с учетом всех технических требований и стандартов безопасности. Мы гарантируем, что врезка фурнитуры будет выполнена профессионально, обеспечивая долговечность и надежность вашей двери.
							</div>
							<hr />
						</li>
						<li>
							<hr />
							<div className="timeline-middle text-primary">
								<svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 20 20" fill="currentColor" className="h-5 w-5"><path fillRule="evenodd" d="M10 18a8 8 0 100-16 8 8 0 000 16zm3.857-9.809a.75.75 0 00-1.214-.882l-3.483 4.79-1.88-1.88a.75.75 0 10-1.06 1.061l2.5 2.5a.75.75 0 001.137-.089l4-5.5z" clipRule="evenodd" /></svg>
							</div>
							<div className="timeline-end mb-10">
								<div className="text-lg font-black text-primary">
									Установка блока в проем
								</div>
								На этом этапе наши опытные мастера производят установку дверного блока в проем с высокой точностью и профессионализмом. Каждый элемент устанавливается с учетом тщательного контроля, чтобы обеспечить правильное прилегание и оптимальную работу двери. Мы используем современное оборудование и проверенные методы, чтобы гарантировать, что установка будет выполнена эффективно и в срок. После завершения этого этапа, вы сможете наслаждаться функциональностью и эстетикой вашей новой двери.
							</div>
							<hr />
						</li>
						<li>
							<hr />
							<div className="timeline-middle text-primary">
								<svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 20 20" fill="currentColor" className="h-5 w-5"><path fillRule="evenodd" d="M10 18a8 8 0 100-16 8 8 0 000 16zm3.857-9.809a.75.75 0 00-1.214-.882l-3.483 4.79-1.88-1.88a.75.75 0 10-1.06 1.061l2.5 2.5a.75.75 0 001.137-.089l4-5.5z" clipRule="evenodd" /></svg>
							</div>
							<div className="timeline-start md:text-end mb-10">
								<div className="text-lg font-black text-primary">
									Запенивание дверного блока
								</div>
								На данном этапе проводится запенивание дверного блока, что обеспечивает надежную тепло- и звукоизоляцию. Наша команда использует специальные современные материалы для запенивания, гарантируя отличные результаты. Этот процесс также способствует укреплению конструкции двери и созданию дополнительного барьера от внешних факторов. Запенивание выполняется в соответствии с высокими стандартами качества, чтобы обеспечить долговечность и эффективность вашей двери.
							</div>
							<hr />
						</li>
						<li>
							<hr />
							<div className="timeline-middle text-primary">
								<svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 20 20" fill="currentColor" className="h-5 w-5"><path fillRule="evenodd" d="M10 18a8 8 0 100-16 8 8 0 000 16zm3.857-9.809a.75.75 0 00-1.214-.882l-3.483 4.79-1.88-1.88a.75.75 0 10-1.06 1.061l2.5 2.5a.75.75 0 001.137-.089l4-5.5z" clipRule="evenodd" /></svg>
							</div>
							<div className="timeline-end mb-10">
								<div className="text-lg font-black text-primary">
									Установка доборов и наличников
								</div>
								На этом этапе наши мастера проводят установку доборов и наличников, придающих завершенный вид вашей двери. Мы используем высококачественные материалы и инструменты для точной посадки и качественной финишной обработки. Установка доборов и наличников не только придает двери эстетическую завершенность, но и улучшает ее функциональные характеристики, такие как тепло- и звукоизоляция. Мы стремимся достичь идеального сочетания стиля, прочности и функциональности на каждом этапе наших работ.
							</div>
						</li>
					</ul>
				</div>
			</div>
		</section>
	)
}

export default Step